Revit 2024 API
InitialLuminousIntensity Constructor (InitialLuminousIntensity)
 Creates a copy of the given initial luminous intensity object
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public InitialLuminousIntensity(
	InitialLuminousIntensity other
)
Visual Basic
Public Sub New ( _
	other As InitialLuminousIntensity _
)
Visual C++
public:
InitialLuminousIntensity(
	InitialLuminousIntensity^ other
)
Parameters
other
Type: Autodesk.Revit.DB.Lighting.InitialLuminousIntensity
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
InitialLuminousIntensity Class
InitialLuminousIntensity Overload
Autodesk.Revit.DB.Lighting Namespace